<a href="https://colab.research.google.com/github/rafaelrafaelfer/Pandas-Data/blob/main/Trabalhando_com_Planilhas_do_Excel_no_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [4]:
df = pd.concat([df1, df2, df3, df4, df5])

In [5]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
df.sample(15)

        Cidade       Data  Vendas  LojaID  Qtde
128   Salvador 2019-03-02   36.84    1034     1
69   Fortaleza 2019-01-01  216.65    1003     6
119  Fortaleza 2019-03-02  152.30     982     7
19    Salvador 2019-01-01  167.12    1035     1
94      Recife 2019-01-01   24.70     982     3
25       Natal 2019-01-13  611.00     852     2
236      Natal 2019-01-03  126.29    1035     3
6       Recife 2019-01-01   16.27     981     6
103    Aracaju 2018-01-01   12.62    1522     3
152   Salvador 2019-01-02   20.07    1035     1
140  Fortaleza 2019-03-02  166.89     983     5
82       Natal 2019-03-07  868.00     854     3
143   Salvador 2019-01-02   41.18    1037     2
145   Salvador 2019-01-02   84.62    1034     2
239      Natal 2019-01-03  161.41    1037     3

In [8]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [9]:
df["LojaID"] = df['LojaID'].astype('object')

In [10]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [11]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [12]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [14]:
df["Vendas"].mean()

122.61180089485438

In [15]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
75    Salvador 2019-01-01  155.52   1034     1
99       Natal 2019-01-02   40.38   1037     1
124  Fortaleza 2019-03-02   47.98    983     7
89   Fortaleza 2019-01-01    7.19   1004     5
78       Natal 2019-02-07  310.00    853     4
141      Natal 2019-01-02    9.08   1036     1
82    Salvador 2019-01-01  207.88   1035     1
110     Recife 2019-03-02   51.98    983     6
101   Salvador 2019-01-01   32.28   1035     3
108  Fortaleza 2019-03-02  152.89    981     4
217      Natal 2019-01-02   37.65   1036     2
50       Natal 2019-03-08  324.00    854     4
31    Salvador 2019-01-01  202.25   1035     2
39    Salvador 2019-01-01  165.95   1036     3
160      Natal 2019-01-02   11.76   1034     1

In [16]:
df.dropna(inplace=True)

In [17]:
df['Receita'] = df['Vendas'].mul(df['Qtde'])

In [18]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [19]:
df['Receitas/Vendas'] = df['Receita'] / df['Vendas']

In [20]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00              1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26              6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55              1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07              7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08              8.0

In [21]:
df['Receita'].max()

3544.0

In [23]:
df['Receita'].min()

3.34

In [24]:
df.nlargest(5, 'Receita')

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0              4.0
51  Natal 2018-01-21   859.0    852     4   3436.0              4.0
55  Natal 2019-01-08   859.0    854     4   3436.0              4.0
30  Natal 2018-10-02   856.0    853     4   3424.0              4.0
41  Natal 2018-05-20   835.0    852     4   3340.0              4.0

In [26]:
df.nsmallest(5, 'Receita')

       Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
118   Aracaju 2018-01-01    3.34   1522     1     3.34              1.0
65     Recife 2019-01-01    4.01    981     1     4.01              1.0
92      Natal 2019-01-02    4.57   1035     1     4.57              1.0
92   Salvador 2019-01-01    4.57   1035     1     4.57              1.0
95      Natal 2019-01-02    5.13   1035     1     5.13              1.0

In [27]:
df.groupby('Cidade')['Receita'].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [28]:
df.sort_values('Receita', ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0              4.0
55  Natal 2019-01-08   859.0    854     4   3436.0              4.0
51  Natal 2018-01-21   859.0    852     4   3436.0              4.0
30  Natal 2018-10-02   856.0    853     4   3424.0              4.0
41  Natal 2018-05-20   835.0    852     4   3340.0              4.0
38  Natal 2018-02-25   828.0    852     4   3312.0              4.0
10  Natal 2018-10-27   828.0    852     4   3312.0              4.0
69  Natal 2019-03-24   817.0    852     4   3268.0              4.0
62  Natal 2018-02-10   793.0    854     4   3172.0              4.0
52  Natal 2018-04-27   778.0    854     4   3112.0              4.0